function showMessage() {
    var alex = [1, 2, 3, 4, 5];
    alex.pop();
    alex.shift();

    console.log(alex.length);
}

showMessage();


//**************
//***МАССИВЫ****
//**************
// .length - длинна массива
// a.push() - добавление элементов в конец массива
// a.unshift() - добавление элемента в начало массива, всё смещается
// a.pop() - уменьшает длинну массива на 1, возвращает значение удаленного элемента
//a.shift() - удаляет элемент в начале массива
//
//
//
