function showMessage() {
	var stack = [];
	stack.push(1,2);
	stack.pop();
	stack.push(3);
	stack.pop();
	stack.push([4,5]);
	stack.pop();
	stack.pop();
	
	var otvet = stack;
	console.log(otvet);
}

showMessage();







//a.toLowerCase() - в нижний регистр
//**************
//***МАССИВЫ****
//**************
// .length - длинна массива
// a.push() - добавление элементов в конец массива
// a.unshift() - добавление элемента в начало массива, всё смещается
// a.pop() - уменьшает длинну массива на 1, возвращает значение удаленного элемента
//a.shift() - удаляет элемент в начале массива
//a.forEach() - берем каждый элемент массива
//a.join() - преобразует все элементы массива в строки, объединяет их и возвращает строку
//a.reverse() - меняет порядок следования элементов в массиве на обратный
//a.sort() - сортирует элементы в исходном массиве и возвращает отсортированный массив
//a.concat() - возвращает новый массив, содержащий элементы исходного массива
//a.slice() - возвращает фрагмент, или подмассив, указанного массива
//a.splice() - удаляет элементы из массива, вставляет или выполняет обе операции одновременно
//a.push() - добавляет один или несколько новых элементов в конец массива
//a.pop() - удаляет последний элемент массива
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
